In [1]:
import numpy as np
import pandas as pd

In [2]:
df = pd.read_csv('baseball_shop.csv', delimiter=',', skiprows=0, header=0)
display(df)
print( df.shape )
print( df.dtypes )
display( df.info() )
display( df.describe() )
display( df.describe(exclude='number') )
display( df.head() )

     ShopID      Pref  Product  Price  Amount
0        18  Kanagawa      BAT  13800      10
1        18  Kanagawa  UNIFORM  11800      12
2        18  Kanagawa    GLOVE  16700      10
3        18  Kanagawa    SHOES  12800      10
4        30   Ibaraki      BAT  13800       8
..      ...       ...      ...    ...     ...
371      93  Kanagawa    SHOES  12800       7
372      13     Tokyo      BAT  13800       8
373      13     Tokyo  UNIFORM  11800      10
374      13     Tokyo    GLOVE  16700       9
375      13     Tokyo    SHOES  12800       8

[376 rows x 5 columns]

(376, 5)
ShopID      int64
Pref       object
Product    object
Price       int64
Amount      int64
dtype: object
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 376 entries, 0 to 375
Data columns (total 5 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   ShopID   376 non-null    int64
 1   Pref     376 non-null    object
 2   Product  376 non-null    object
 3   Price    376 non-null    int64
 4   Amount   376 non-null    int64
dtypes: int64(3), object(2)
memory usage: 14.8+ KB

None

           ShopID         Price      Amount
count  376.000000    376.000000  376.000000
mean    47.500000  13775.000000    7.255319
std     27.170082   1833.252119    4.975001
min      1.000000  11800.000000    0.000000
25%     24.000000  12550.000000    4.000000
50%     47.500000  13300.000000    6.000000
75%     71.000000  14525.000000    9.000000
max     94.000000  16700.000000   44.000000

            Pref  Product
count        376      376
unique         7        4
top     Kanagawa  UNIFORM
freq          68       94

   ShopID      Pref  Product  Price  Amount
0      18  Kanagawa      BAT  13800      10
1      18  Kanagawa  UNIFORM  11800      12
2      18  Kanagawa    GLOVE  16700      10
3      18  Kanagawa    SHOES  12800      10
4      30   Ibaraki      BAT  13800       8

In [3]:
print(df['Pref'].value_counts())
print(df['Product'].value_counts())

Kanagawa    68
Tokyo       68
Chiba       64
Saitama     48
Ibaraki     48
Tochigi     40
Gunma       40
Name: Pref, dtype: int64
UNIFORM    94
SHOES      94
BAT        94
GLOVE      94
Name: Product, dtype: int64

In [4]:
print( len(df['ShopID'].value_counts()) )
print( len(df['ShopID'].unique()) )

94
94

In [5]:
df['Sales'] =  df['Price']*df['Amount']
display(df)

     ShopID      Pref  Product  Price  Amount   Sales
0        18  Kanagawa      BAT  13800      10  138000
1        18  Kanagawa  UNIFORM  11800      12  141600
2        18  Kanagawa    GLOVE  16700      10  167000
3        18  Kanagawa    SHOES  12800      10  128000
4        30   Ibaraki      BAT  13800       8  110400
..      ...       ...      ...    ...     ...     ...
371      93  Kanagawa    SHOES  12800       7   89600
372      13     Tokyo      BAT  13800       8  110400
373      13     Tokyo  UNIFORM  11800      10  118000
374      13     Tokyo    GLOVE  16700       9  150300
375      13     Tokyo    SHOES  12800       8  102400

[376 rows x 6 columns]

In [6]:
shops = df['ShopID'].unique()
for shop in shops:
    print(shop, df[ df['ShopID']==shop ]['Sales'].sum())
print("Total Sum:", df['Sales'].sum())

18 574600
30 382800
73 623600
68 176100
14 422000
84 403400
33 504900
28 421100
47 483100
2 294100
90 620400
22 322700
75 276600
39 489200
19 233200
70 481000
81 403300
86 654300
71 385700
52 460400
80 282600
20 248100
12 451500
40 920200
53 282200
48 496000
76 1091000
37 434800
89 263600
60 427000
61 296200
25 327600
77 345300
69 469400
88 349400
74 513600
51 313900
41 663200
87 187900
54 369900
23 355200
85 177100
78 234100
66 400400
67 232200
38 191000
94 439800
91 329600
59 361100
32 303000
92 319800
44 477100
82 394500
16 122000
21 463400
1 264700
17 232100
7 401400
11 249900
56 351400
4 215600
55 365000
26 303000
46 225400
72 376900
3 148500
45 315800
64 221300
34 435800
57 834400
49 1822600
63 403200
10 341600
9 550100
62 620700
29 278300
27 161300
50 473000
58 333700
35 316800
36 208600
8 368000
6 299200
24 271600
43 410300
83 415400
65 307100
31 413400
15 378800
5 346200
42 279400
79 347300
93 368100
13 481100
Total Sum: 37283200

In [7]:
display(df)
de_pref = df.drop(df.loc[:, 'Product':'Amount'], axis=1).drop('ShopID', axis=1)
display(de_pref)
de_pref = de_pref.groupby('Pref').sum()
# for pref in prefs:
#     print(pref, df[ df['Pref']==pref ]['Sales'].sum())
# print("Total Sum:", df['Sales'].sum())
display(de_pref)

     ShopID      Pref  Product  Price  Amount   Sales
0        18  Kanagawa      BAT  13800      10  138000
1        18  Kanagawa  UNIFORM  11800      12  141600
2        18  Kanagawa    GLOVE  16700      10  167000
3        18  Kanagawa    SHOES  12800      10  128000
4        30   Ibaraki      BAT  13800       8  110400
..      ...       ...      ...    ...     ...     ...
371      93  Kanagawa    SHOES  12800       7   89600
372      13     Tokyo      BAT  13800       8  110400
373      13     Tokyo  UNIFORM  11800      10  118000
374      13     Tokyo    GLOVE  16700       9  150300
375      13     Tokyo    SHOES  12800       8  102400

[376 rows x 6 columns]

         Pref   Sales
0    Kanagawa  138000
1    Kanagawa  141600
2    Kanagawa  167000
3    Kanagawa  128000
4     Ibaraki  110400
..        ...     ...
371  Kanagawa   89600
372     Tokyo  110400
373     Tokyo  118000
374     Tokyo  150300
375     Tokyo  102400

[376 rows x 2 columns]

            Sales
Pref
Chiba     5343100
Gunma     4021000
Ibaraki   4513500
Kanagawa  5813100
Saitama   5276800
Tochigi   3296300
Tokyo     9019400

In [11]:
display(de_pref)
max_sale_pref = de_pref.loc[ de_pref['Sales'].idxmax() ]
display( max_sale_pref )

            Sales
Pref
Chiba     5343100
Gunma     4021000
Ibaraki   4513500
Kanagawa  5813100
Saitama   5276800
Tochigi   3296300
Tokyo     9019400

Sales    9019400
Name: Tokyo, dtype: int64

In [12]:
display(df)

     ShopID      Pref  Product  Price  Amount   Sales
0        18  Kanagawa      BAT  13800      10  138000
1        18  Kanagawa  UNIFORM  11800      12  141600
2        18  Kanagawa    GLOVE  16700      10  167000
3        18  Kanagawa    SHOES  12800      10  128000
4        30   Ibaraki      BAT  13800       8  110400
..      ...       ...      ...    ...     ...     ...
371      93  Kanagawa    SHOES  12800       7   89600
372      13     Tokyo      BAT  13800       8  110400
373      13     Tokyo  UNIFORM  11800      10  118000
374      13     Tokyo    GLOVE  16700       9  150300
375      13     Tokyo    SHOES  12800       8  102400

[376 rows x 6 columns]